Домашнее задание по теме «Основы Pandas»
## Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [79]:
import pandas as pd

In [27]:
data = pd.read_csv('C:/Users/User/Desktop/gitKraken/netology_pyda/ml-20m/ratings.csv')

In [28]:
data.head()

   userId  movieId  rating   timestamp
0       1        2     3.5  1112486027
1       1       29     3.5  1112484676
2       1       32     3.5  1112484819
3       1       47     3.5  1112484727
4       1       50     3.5  1112484580

In [35]:
data_sort= data[(data['rating']==5)]

In [36]:
data_sort.head()

     userId  movieId  rating   timestamp
131       1     4993     5.0  1112484682
142       1     5952     5.0  1112484619
158       1     7153     5.0  1112484633
170       1     8507     5.0  1094786027
176       2       62     5.0   974820598

In [56]:
data['movieId'].value_counts().head(1)

296    67310
Name: movieId, dtype: int64

In [54]:
data_mov = pd.read_csv('C:/Users/User/Desktop/gitKraken/netology_pyda/ml-20m/movies.csv')

In [55]:
data_mov.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [59]:
data_mov[(data_mov['movieId']==296)]

     movieId                title                       genres
293      296  Pulp Fiction (1994)  Comedy|Crime|Drama|Thriller

## Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [3]:
power = pd.read_csv('C:/Users/User/Desktop/gitKraken/Python_6_pandas_basics/power.csv')

In [4]:
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [5]:
power[power['country'].str.contains('est', case=False) ]['country'].unique()

array(['Estonia', 'State of Palestine', 'Timor-Leste'], dtype=object)

In [70]:
filtered_power=power[ ((power['country']=='Lithuania') | (power['country']=='Latvia') |(power['country']=='Estonia')) 
                     & ((power['category']==4)|(power['category']==12)|(power['category']==21)) 
                     & (power['year']>=2005) & (power['year']<=2010)]

In [75]:
filtered_power.head(5)

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [86]:
filtered_power.tail()

          country  year  quantity  category
253982  Lithuania  2009      98.0        21
253983  Lithuania  2008      54.0        21
253984  Lithuania  2007      47.0        21
253985  Lithuania  2006      31.0        21
253986  Lithuania  2005       1.0        21

## Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [104]:
pd.read_html('https://www.dme.ru/flight/live-board/')

[              0   1
 0  Отправление: NaN,     0  1        2
 0 NaN  /  Вылет /,    Unnamed: 0_level_0  Дата и время                \
    Unnamed: 0_level_1    Плановое ▲   Фактическое
 0        ▲13:00▼14:00  28 авг 13:00  28 авг 12:42
 1        ▲13:00▼14:00  28 авг 13:05  28 авг 12:45
 2        ▲13:00▼14:00  28 авг 13:15  28 авг 13:02
 3        ▲13:00▼14:00  28 авг 13:20  28 авг 13:22
 4        ▲13:00▼14:00  28 авг 13:35  28 авг 13:35
 5        ▲13:00▼14:00  28 авг 13:40  28 авг 13:54
 6        ▲13:00▼14:00  28 авг 13:40  28 авг 13:35
 7        ▲13:00▼14:00  28 авг 13:45  28 авг 13:42
 8        ▲13:00▼14:00  28 авг 13:45  28 авг 13:51
 9        ▲13:00▼14:00  28 авг 13:45  28 авг 13:39
 10       ▲13:00▼14:00  28 авг 13:50  28 авг 14:00
 11       ▲13:00▼14:00  28 авг 13:50  28 авг 13:30
 12       ▲13:00▼14:00  28 авг 13:55  28 авг 14:53
 13       ▲13:00▼14:00  28 авг 13:55  28 авг 13:49
 14              14:00  28 авг 14:00  28 авг 13:56
 15       ▲14:00▼15:00  28 авг 14:05  28 авг 14:10
 16       ▲14:00▼15:00  28 авг 14:15  28 авг 14:04
 17       ▲14:00▼15:00  28 авг 14:25  28 авг 14:38
 18       ▲14:00▼15:00  28 авг 14:30  28 авг 14:54
 19       ▲14:00▼15:00  28 авг 14:40  28 авг 14:20
 20       ▲14:00▼15:00  28 авг 14:45           NaN
 21       ▲14:00▼15:00  28 авг 14:50  28 авг 15:23
 22       ▲14:00▼15:00  28 авг 14:50  28 авг 14:51
 23       ▲14:00▼15:00  28 авг 14:55  28 авг 14:55
 24              15:00  28 авг 15:00  28 авг 15:13
 25       ▲15:00▼16:00  28 авг 15:00  28 авг 15:13
 26       ▲15:00▼16:00  28 авг 15:00  28 авг 15:12
 27       ▲15:00▼16:00  28 авг 15:05           NaN
 28       ▲15:00▼16:00  28 авг 15:10           NaN
 29       ▲15:00▼16:00  28 авг 15:10  28 авг 15:01
 30       ▲15:00▼16:00  28 авг 15:15           NaN
 31       ▲15:00▼16:00  28 авг 15:25           NaN
 32       ▲15:00▼16:00  28 авг 15:30           NaN
 33       ▲15:00▼16:00  28 авг 15:35           NaN
 34       ▲15:00▼16:00  28 авг 15:45           NaN
 35       ▲15:00▼16:00  28 авг 15:45  28 авг 15:24
 36       ▲15:00▼16:00  28 авг 15:50  28 авг 15:28
 37              16:00  28 авг 16:00           NaN
 38       ▲16:00▼16:00  28 авг 16:10           NaN
 39       ▲16:00▼16:00  28 авг 16:15           NaN
 40       ▲16:00▼16:00  28 авг 16:15           NaN
 41       ▲16:00▼16:00  28 авг 16:15           NaN
 42       ▲16:00▼16:00  28 авг 16:20           NaN
 43       ▲16:00▼16:00  28 авг 16:20           NaN
 44       ▲16:00▼16:00  28 авг 16:25           NaN
 45       ▲16:00▼16:00  28 авг 16:25           NaN
 46       ▲16:00▼16:00  28 авг 16:30           NaN
 47       ▲16:00▼16:00  28 авг 16:30           NaN
 48       ▲16:00▼16:00  28 авг 16:30           NaN
 49       ▲16:00▼16:00  28 авг 16:35           NaN

                                               № Рейса Аэропорт отправления  \
                                               № Рейса Аэропорт отправления
 0                                             S7 2004          СИМФЕРОПОЛЬ
 1                                         S7 78 GH 78          КАЛИНИНГРАД
 2                                       GH 272 S7 272          СИМФЕРОПОЛЬ
 3                                              G9 955               ШАРДЖА
 4   S7 1164 B2 164 SQ 1978 QR 5779 GH 1164 EK 7924...            ВОЛГОГРАД
 5   S7 1148 JL 7190 EK 7846 RJ 3460 QR 5761 GH 114...            КРАСНОДАР
 6                                              YC 515          СИМФЕРОПОЛЬ
 7                     S7 1126 QR 5769 GH 1126 S7 7804                АНАПА
 8                                              OS 601                 ВЕНА
 9                                              PC 388              СТАМБУЛ
 10                             EK 133 S7 4164 QF 8133                ДУБАЙ
 11                                            KK 1502              СТАМБУЛ
 12                             B2 951 S7 4528 U6 4951                МИНСК
 13                                      S7 126 GH 126         БЛАГОВЕЩЕНСК
 14  S7 46 QR 5743 A3 3522 EK 7874 GH 46 RJ 3452 YM...      САНКТ-ПЕТЕРБУРГ
 15                                             U6 448                 СОЧИ
 16  S7 302 JL 7182 GH 302 A3 3540 QR 5721 LY 8984 ...                ПЕРМЬ
 17                                    S7 1068 GH 1068               КАЗАНЬ
 18                                     BA 233 S7 4000               ЛОНДОН
 19                                            IB 3188               МАДРИД
 20                                            Y7 1052                АНАПА
 21                                             6R 529          НОВОСИБИРСК
 22                                             Y7 112             НОРИЛЬСК
 23                                            5N 9302              ДАЛАМАН
 24                                     JL 421 S7 4122                ТОКИО
 25                                      GH 164 S7 164          СИМФЕРОПОЛЬ
 26                                             U6 372          КАЛИНИНГРАД
 27                                             U6 444                АНАПА
 28                                             5N 546                АНАПА
 29                                            LH 2528               МЮНХЕН
 30  GH 1046 JL 7178 EK 7812 SQ 1968 S7 1046 LY 894...                 СОЧИ
 31                                      GH 112 S7 112               МИРНЫЙ
 32                                     9U 171 S7 4538              КИШИНЕВ
 33                                            WZ 5016              АНТАЛЬЯ
 34                                             U6 280                 СОЧИ
 35                                     5N 254 WZ 5254          КАЛИНИНГРАД
 36  GH 182 S7 182 BA 8810 A3 3577 QR 5753 LY 8982 ...          НОВОСИБИРСК
 37                                              U6 60      САНКТ-ПЕТЕРБУРГ
 38              GH 882 SQ 1964 QR 5681 EK 7956 S7 882          ВЛАДИКАВКАЗ
 39                                  S7 6 EK 7821 GH 6      НИЖНИЙ НОВГОРОД
 40                                             WZ 258            КРАСНОДАР
 41                      S7 226 EK 7911 GH 226 YC 4226             БЕЛГОРОД
 42                                    S7 1070 GH 1070               КАЗАНЬ
 43                                     5N 554 WZ 5554          СИМФЕРОПОЛЬ
 44                                      S7 208 GH 208              САРАТОВ
 45                                            U6 2832          СИМФЕРОПОЛЬ
 46                              GH 932 S7 932 YM 4612                ТИВАТ
 47                                             U6 300         БЛАГОВЕЩЕНСК
 48                                             U6 116            ГЕЛЕНДЖИК
 49                                             6R 640     МИНЕРАЛЬНЫЕ ВОДЫ

                                                Статус Напомнить В избранное
                                                Статус Напомнить В избранное
 0   ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 1   ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 2   ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 3   ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 4   ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 5   ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 6   ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 7   ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 8   ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 9   ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 10  ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 11  ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 12  ПрибылВыдача багажа на ленте 1  Прибыл  Выдача...       NaN         NaN
 13  ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 14  ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 15  ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 16  ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 17  ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 18  ПрибылВыдача багажа заканчивается  Прибыл  Выд...       NaN         NaN
 19  ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 20               Ожидается в 16:26  Ожидается в 16:26       NaN         NaN
 21  ПрибылОжидается выдача багажа на ленте 8  Приб...       NaN         NaN
 22  ПрибылВыдача багажа окончена  Прибыл  Выдача б...       NaN         NaN
 23  ПрибылВыдача багажа заканчивается  Прибыл  Выд...       NaN         NaN
 24  ПрибылВыдача багажа на ленте 4  Прибыл  Выдача...       NaN         NaN
 25  ПрибылОжидается выдача багажа на ленте 7  Приб...       NaN         NaN
 26  ПрибылВыдача багажа на ленте 5  Прибыл  Выдача...       NaN         NaN
 27               Ожидается в 17:10  Ожидается в 17:10       NaN         NaN
 28               Ожидается в 19:10  Ожидается в 19:10       NaN         NaN
 29  ПрибылВыдача багажа заканчивается  Прибыл  Выд...       NaN         NaN
 30               Ожидается в 16:10  Ожидается в 16:10       NaN         NaN
 31               Ожидается в 16:11  Ожидается в 16:11       NaN         NaN
 32               Ожидается в 15:45  Ожидается в 15:45       NaN         NaN
 33               Ожидается в 15:27  Ожидается в 15:27       NaN         NaN
 34               Ожидается в 15:34  Ожидается в 15:34       NaN         NaN
 35                                     Прибыл  Прибыл       NaN         NaN
 36                           Приземлился  Приземлился       NaN         NaN
 37               Ожидается в 15:46  Ожидается в 15:46       NaN         NaN
 38               Ожидается в 17:27  Ожидается в 17:27       NaN         NaN
 39                                     В пути  В пути       NaN         NaN
 40               Ожидается в 16:40  Ожидается в 16:40       NaN         NaN
 41               Ожидается в 15:50  Ожидается в 15:50       NaN         NaN
 42               Ожидается в 16:40  Ожидается в 16:40       NaN         NaN
 43               Ожидается в 15:46  Ожидается в 15:46       NaN         NaN
 44               Ожидается в 15:52  Ожидается в 15:52       NaN         NaN
 45               Ожидается в 16:40  Ожидается в 16:40       NaN         NaN
 46                                     В пути  В пути       NaN         NaN
 47               Ожидается в 16:11  Ожидается в 16:11       NaN         NaN
 48               Ожидается в 18:10  Ожидается в 18:10       NaN         NaN
 49                                     В пути  В пути       NaN         NaN  ]